app/views/videos/index.html.erb


			<% if current_user.my_lists.where(video_id: movie.id.videoId).exists? %>
---
SELECT  "my_lists".* FROM "my_lists" WHERE "my_lists"."user_id" = ? AND "my_lists"."video_id" = ? LIMIT ?  [["user_id", 1], ["video_id", "gFrmh2nMM9g"], ["LIMIT", 1]]
SELECT  1 AS one FROM "my_lists" WHERE "my_lists"."user_id" = ? AND "my_lists"."video_id" = ? LIMIT ?  [["user_id", 2], ["video_id", 9], ["LIMIT", 1]]