app/views/my_lists/index.html.erb

SELECT  "my_lists".* FROM "my_lists" WHERE "my_lists"."user_id" = ? AND "my_lists"."video_id" = ? LIMIT ?  [["user_id", 1], ["video_id", "q0__GvBnzgY"], ["LIMIT", 1]]
SELECT  1 AS one FROM "my_lists" WHERE "my_lists"."user_id" = ? AND "my_lists"."video_id" IS NULL LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
			<div id="drag" class="draggable hoverable">
				<% if current_user.my_lists.where(video_id: movie.video_id).exists? %>