app/controllers/my_lists_controller.rb

INSERT INTO "my_lists" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2018-02-25 11:10:19.841088"], ["updated_at", "2018-02-25 11:10:19.841088"]]
---
	def create
		v_id = params[:format]
		@my_list = current_user.my_lists.new(video_id: v_id)
		@my_list.save

SELECT  "my_lists".* FROM "my_lists" WHERE "my_lists"."user_id" = ? AND "my_lists"."video_id" = ? LIMIT ?  [["user_id", 1], ["video_id", "zn9ZDJqkYWo"], ["LIMIT", 1]]
DELETE FROM "my_lists" WHERE "my_lists"."id" = ?  [["id", 7]]
---
	def destroy
		v_id = params[:id]
		@my_list = current_user.my_lists.find_by(video_id: v_id)
		@my_list.destroy

SELECT  "my_lists".* FROM "my_lists" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "my_lists"
---
	def index
		@my_lists = MyList.all.page(params[:page]).per(8)